package practice.regex;

/**
 Задание 1
 Цель SplitText

 Научиться писать и использовать несложные регулярные выражения.
 Что нужно сделать

 Реализуйте метод, который принимает в качестве аргумента строку, содержащую английский текст (не менее 100 слов).
 Метод должен разделить текст на слова и вернуть строку, состоящую из полученных слов, где каждое слово будет на
 отдельной строке. Знаки препинания и числа не являются словами.

 Запустите в проекте тесты и убедитесь в том, что они выполняются успешно. Если тесты не выполняются и выдают
 информацию об ошибках, постарайтесь самостоятельно исправить эти ошибки и добиться успешного выполнения тестов
 перед отправкой результатов преподавателю.

 Задание 2
 Цель PhoneCleanerRegex

 Научиться писать и использовать несложные регулярные выражения.
 Что нужно сделать

 Реализуйте удаление лишних символов при вводе номера телефона в консоли и проверку соответствия номера формату
 мобильных номеров в России. Если введённую строку нельзя привести к формату мобильного номера, выводите сообщение
 о неверном вводе. Телефон может быть введён не только в формате 79091234567, но и с лишними символами.

 Задание 3

 Цель TotalEarningsCalculatorRegex
 Научиться работать с методами indexOf(), lastIndexOf(), substring() и trim() класса String.

 Что необходимо сделать

 Напишите код, который считает сумму заработка всех друзей. Используйте методы indexOf(), lastIndexOf(),
 substring() и trim(). Использование регулярных выражений в данном задании не допускается.

 Задание 4
 Цель FullNameFormatterRegex

 Что необходимо сделать

 Напишите программу, которая на входе через консоль принимает фамилию, имя и отчество одной строкой (например,
 «Иванов Сергей Петрович») и выводит фамилию, имя и отчество отдельно в формате:

 Фамилия: Иванов

 Имя: Сергей

 Отчество: Петрович

 Валидная строка от пользователя, которую мы можем интерпретировать как ФИО, должна содержать три слова, состоящих
 из кириллических символов, разделённых пробелом, может содержать дефис. Если строка не соответствует формату, то
 в консоль выводится: Введенная строка не является ФИО.

 Использование регулярных выражений в данном задании не допускается.
 */